**VIDEO 1**

In [1]:
import pandas as pd

In [2]:
data = {'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
        'Edad': [25,30,22,27],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']}

df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [3]:
df['Salario'] = [30000,45000,38000,32000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [4]:
df['Salario'] = df['Salario'] + 3000
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    33000
1    Luis    30  Barcelona    48000
2  Carlos    22   Valencia    41000
3    Sara    27     Bilbao    35000

In [5]:
nombres = df['Nombre']
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [6]:
rucos = df[df['Edad'] > 25]
rucos

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    48000
3   Sara    27     Bilbao    35000

In [7]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df['Edad'])

pandas.core.series.Series

**VIDEO 2**

In [13]:
import pandas as pd

df = pd.read_csv('topPeliculas.csv')
df.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
3,3,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Acción,9.0,84.0,534.86
4,4,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Crimen,9.0,84.0,534.86

In [14]:
df_ordenado = df.sort_values(by='rating')
df_ordenado.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
2531,2531,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Drama,7.6,0.0,0.0
2530,2530,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Crimen,7.6,0.0,0.0
2529,2529,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Acción,7.6,0.0,0.0
2528,2528,998.0,The Invisible Man,James Whale,1933.0,71.0,Ciencia Ficción,7.6,87.0,0.0
2495,2495,986.0,From Here to Eternity,Fred Zinnemann,1953.0,118.0,Guerra,7.6,85.0,30.5

In [15]:
df_ordenado = df.sort_values(by='rating', ascending = False)
df_ordenado.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
5,5,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Drama,9.0,84.0,534.86
12,12,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Aventura,9.0,94.0,377.85

In [18]:
df_ordenado = df.sort_values(by=['rating', 'recaudación(M)'], ascending = False)
df_ordenado.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
3,3,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Acción,9.0,84.0,534.86
4,4,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Crimen,9.0,84.0,534.86

In [19]:
df_agrupado = df.groupby('género')['rating'].mean()
df_agrupado

género
Acción             7.987255
Animación          7.943902
Aventura           7.980435
Biografía          7.971698
Ciencia Ficción    7.986567
Comedia            7.909910
Crimen             7.993500
Deportes           7.980000
Drama              7.980444
Familiar           7.932692
Fantasía           7.929508
Film-Noir          7.977273
Guerra             8.053191
Historia           7.931818
Misterio           7.991262
Musica             7.909677
Musical            7.943750
Romance            7.937398
Terror             7.875758
Thriller           7.929286
Western            8.006250
Name: rating, dtype: float64

In [20]:
df_agrupado = df.groupby('año')['recaudación(M)'].sum()
df_agrupado.sort_values(ascending=False).head(10)

año
2014.0    8015.90
2019.0    7092.95
2010.0    6899.96
2016.0    6860.23
2015.0    6817.12
2012.0    6487.22
2009.0    6486.34
2018.0    5992.02
2008.0    5603.30
2017.0    5381.90
Name: recaudación(M), dtype: float64

In [23]:
import pandas as pd 

datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}

df = pd.DataFrame(datos)
df_ordenado = df.sort_values(by='año')
df_ordenado.head()

       titulo   año  rating
1  Pelicula B  2000     6.5
0  Pelicula A  2001     7.2
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5

In [26]:
import pandas as pd 

datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}

df = pd.DataFrame(datos)
df_ordenado = df.sort_values(by='rating')
df_ordenado = df.sort_values(by='año', ascending=False)
df_ordenado.head()

       titulo   año  rating
3  Pelicula D  2010     7.5
2  Pelicula C  2005     8.1
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5

In [28]:
import pandas as pd 
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
    'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
    'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
}

df = pd.DataFrame(datos)

promedio_rating_por_genero = df.groupby('género')['rating'].mean()

print(promedio_rating_por_genero)

género
Acción     8.15
Comedia    6.50
Drama      8.15
Name: rating, dtype: float64